a = '''기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
기본
설교
설교
설교
설교
설교
설교
설교
설교
설교
용돈
용돈
용돈
용돈
용돈
용돈
용돈
용돈
용돈'''
a = a.split('\n')


b = '''전사 평가
전사 평가
전사 평가
마법 평가
마법 평가
마법 평가
사교 평가
사교 평가
사교 평가
가사 평가
가사 평가
가사 평가
실질 인과
실질 인과
실질 인과
전사 평가
전사 평가
전사 평가
마법 평가
마법 평가
마법 평가
사교 평가
사교 평가
사교 평가
가사 평가
가사 평가
가사 평가
실질 인과
실질 인과
실질 인과
전사 평가
전사 평가
전사 평가
마법 평가
마법 평가
마법 평가
사교 평가
사교 평가
사교 평가
가사 평가
가사 평가
가사 평가
실질 인과
실질 인과
실질 인과

















'''
b = b.split('\n')


c = '''12
12
12
12
12
12
12
12
12
12
12
12
12
12
12
15
15
15
15
15
15
15
15
15
15
15
15
15
15
15
18
18
18
18
18
18
18
18
18
18
18
18
18
18
18
12
12
12
15
15
15
18
18
18
12
13
14
15
16
17
18
19
20'''
c = c.split('\n')
d = '''14
14
14
14
14
14
14
14
14
14
14
14
14
14
14
17
17
17
17
17
17
17
17
17
17
17
17
17
17
17
20
20
20
20
20
20
20
20
20
20
20
20
20
20
20
14
14
14
17
17
17
20
20
20
12
13
14
15
16
17
18
19
20'''
d = d.split('\n')
e = '''체력

근력

지능
감수성

스트레스
매력
도덕성

체력



도덕성

성품

지능
감수성
스트레스

체력
스트레스

감수성



스트레스

근력
감수성

스트레스
스트레스
도덕성

스트레스

체력



스트레스
성품
도덕성
스트레스
도덕성
스트레스
스트레스
스트레스
도덕성
스트레스
스트레스
스트레스
스트레스
스트레스
스트레스
스트레스
스트레스
스트레스'''
e = e.split('\n')
f = '''10

10

10
10

-10
10
10

10



10

5

10
10
-5

10
-10

10



-10

10
10

-10
-10
10

-10

10



10
5
10
10
10
10
10
10
10
-20
-20
-20
-20
-20
-20
-20
-20
-20'''
f = f.split('\n')
g = '''





















































-10
-20
-30
-40
-50
-60
-70
-80
-90'''
g = g.split('\n')
h = '''운동하는 건 즐거워.
검술을 제대로 배워보고 싶어. 멋있을 것 같지 않아? 무기를 휘두르는 내 모습!
좀 더 근육이 붙었으면 좋겠어…..
마법에 재능이 있다는 소리를 들었어!
마법을 잘 하기 위해선, 자연을 잘 이해해야 하나 봐. 근데 무슨… 원소…? 그건 무슨 소리인지….
언젠가는 하늘을 날아보고 싶어,
사람 만나는 건 즐거운 거 같아.
언젠간 멋진 옷을 입고 성에서 춤춰보고 싶어!
흥~흐흥~ (카라마츠는 거울을 보고 있다.)
집안일을 도와준다는 거, 생각보다 어려운 거 같아.
저 손재주가 좋은 편인가요? 이불 같은 건 잘 꼬맬 수 있는데!
쵸로마츠가 나한테 아직 멀었다고 했어요. 언젠간 그 말을 한 걸 후회하게 해 주지!
신사 말인데, 그곳에 가면 왠지 편안하단 말이지.
신사에 여우 동상이 있어. 근데 그거, 움직인다더라!?
신사에 있는 사람 되게 친절한 것 같아.
최근에 곤경에 처한 사람을 도와줬다. 정말로 고마워하더군. 뿌듯했다!
새 검이 하나 사고 싶군… 아, 아니 혼잣말이다.
검술 실력이 늘 수록, 이 힘을 좀 더 조심히 사용해야겠다는 생각이 든다.
마법의 길은 아직도 멀고 멀었다는 생각이 든다…..
이젠 원소에 대해 좀 알 것 같다!
언젠가 마법을 더 잘하게 되면 여러 곳에 여행을 다니고 싶다!
최근에 사람 좋다는 소리를 들었다. 왠지 부끄럽군….
더 많은 사람과 만나보고 싶다.
요즘은 사람을 이끄는 것도 꽤 해 볼 만한 경험이라는 생각이 든다.
요즘은 나도 집안일을 잘 하지 않나~? 흐흥~?
쵸로마츠가 아직도 갈 길이 멀었다고 했다. 집사란 대단한 직업이군…..
최근에 찰흙으로 상어 동상을 만들었다만, 꽤 리얼리티하지 않나?
…..아, 불렀나? 미안하군. 잠시 딴 생각하고 있었다.
(카라마츠는 먼 곳을 보고 있다.)
더 이상 신사에 가지 않는 편이 좋을 지도 모르겠다.....
길 가다가 건달을 만났다. 물론 내가 훌륭하게 제압했지!
미래에 지금까지 배운 검술 실력을 활용할 수 있는 날이 올까?
검을 깨끗하게 닦는 것이 하루의 시작! 검은 내 동반자니까 말이다.
빗자루가 갖고 싶군. 그게 있으면 어디든지 갈 수 있을 텐데.
드래곤이라는 생물이 존재한다고 들었다. 한 번 그 존재를 눈으로 새기고 싶군.
아무래도 내 특기는 얼음마법인 것 같다. 여름에는 시원하게 지낼 수 있겠어!
사람 앞에 나서서 잘 이끌 수 있는 인물, 그건 나라는 존재겠지~! 흐흥~?
나중엔 사람과 대화하면서 그 사람들의 이야기를 들어주는, 그런 일이 하고 싶다.
인간관계는 참 복잡한 것 같다.
쵸로마츠가 드디어 날 인정해준 것 같다!
카라아게란… 인간이 발명한 최고의 음식…. 아침 점심 저녁 전부 카라아게만 먹고 싶군!
집안일에도 체력이 필요한 것 같다. 다 끝나고 나면 엄청 피곤하거든.
…………………. (불러도 반응이 없다.)
곧…. 작별인사를 해야 할 지도 모르겠군….. (혼잣말을 중얼거리고 있지만, 잘 들리지 않는다.)
아, 불렀나? 못 들었다, 미안하군. (3번 부르고 나서야 이 쪽을 돌아봤다.)
………..
제가 뭘 잘못했….나요?
죄송합니다…..
……..
다음부터는 그러지 않겠….습니다.
내가 뭘 잘못했다는 건가?
…………………………………..
나도 이제 다 컸다만… 너무 신경쓰는 게 아닌가?
으음…. 미안하다. 다시는 안 그러도록 하지.
헉, 용돈…! 감사합니다!
헉, 용돈…! 감사합니다!
헉, 용돈…! 감사합니다!
오오, 이걸로 새 옷을 살 수 있겠군!
오오, 이걸로 새 옷을 살 수 있겠군!
오오, 이걸로 새 옷을 살 수 있겠군!
마침 조금 부족한 참이었는데… 고맙다. 아껴서 쓰도록 하지.
마침 조금 부족한 참이었는데… 고맙다. 아껴서 쓰도록 하지.
마침 조금 부족한 참이었는데… 고맙다. 아껴서 쓰도록 하지.'''
h = h.split('\n')

def fail():
    while True:
        print('fail')

length = len(h)
for i in range(length):
    template = 'AddTalk("{}", "{}", {}, {}, "{}", {}, {}, "{}");'

    b[i] = 'null' if b[i] == '' else b[i]
    
    e[i] = 'null' if e[i] == '' else e[i]

    if a[i] == '기본':
        a[i] = 'Basic'
    elif a[i] == '설교':
        a[i] = 'Lecture'
    elif a[i] == '용돈':
        a[i] = 'Money'
    else:
        fail()

    if b[i] == '전사 평가':
        b[i] = 'CombatFame'
    elif b[i] == '마법 평가':
        b[i] = 'MagicFame'
    elif b[i] == '가사 평가':
        b[i] = 'HouseworkFame'
    elif b[i] == '사교 평가':
        b[i] = 'SocialFame'
    elif b[i] == '실질 인과':
        b[i] = 'EffectiveSin'
    elif b[i] == 'null':
        pass
    else:
        fail()

    if e[i] == 'null':
        pass
    elif e[i] == '스트레스':
        e[i] = 'Stress'
    elif e[i] == '성품':
        e[i] = 'Personality'
    elif e[i] == '도덕성':
        e[i] = 'Morality'
    elif e[i] == '체력':
        e[i] = 'Health'
    elif e[i] == '근력':
        e[i] = 'Strength'
    elif e[i] == '지능':
        e[i] = 'Intelligence'
    elif e[i] == '감수성':
        e[i] = 'Character'
    elif e[i] == '매력':
        e[i] = 'Charm'
    else:
        fail()

    f[i] = 'null' if f[i] == '' else f[i]
    g[i] = 'null' if g[i] == '' else g[i]

    res = template.format(a[i], b[i], c[i], d[i], e[i], f[i], g[i], h[i])
    print(res)